% Лабораторная работа №1
% Кирилло Дмитрий, 2 курс, 5 группа ММФ БГУ
% =============================
% Задание 1.2
% =============================
clear;
clc
travel;
help travel;
type travel;
% =============================
% Задание 1.3
% =============================
help help;
% =============================
% Задание 1.4
% =============================
u = [2,2,3];
u = [2 2 3];
v = [1,0,-1];
w = u - 2*v; % the same as w =u - 2.*v
range = 1:13;
odd = 1:2:13;
down = 4: -.5: 0;
even = odd + 1;
xgrid = -1:0.5:1; x = xgrid*pi;
y = sin(x);
w*w';
w'*w;
u*w';
%u*u;
z = u.*u;
% =============================
% Задание 1.5
% =============================
x = -3*pi: .01: 3*pi;
a = plot(x, ((sqrt(3)/4)*sin(3*x).*cos(2*x)));
b = plot(x, ((sin(3*x-(5*pi/11))-sqrt(8)-3*pi)/((exp(-2))+4)));
c = plot(x, (sqrt(5)*(x.^2)/exp(1)));
d = plot(x, (-(sqrt(8*((x+ .1*pi).^2))/5) + 2*pi));
abcdPlot = plot(x, ((sqrt(3)/4)*sin(3*x).*cos(2*x)), x,...
    ((sin(3*x-(5*pi/11))-sqrt(8)-3*pi)/((exp(-2))+4)), x,...
    (sqrt(5)*(x.^2)/exp(1)), x, (-(sqrt(8*((x+ .1*pi).^2))/5) + 2*pi));
%abcdPlot = plot(x, [((sqrt(3)/4)*sin(3*x).*cos(2*x));...
%    ((sin(3*x-(5*pi/11))-sqrt(8)-3*pi)/((exp(-2))+4));...
%    (sqrt(5)*(x.^2)/exp(1)); (-(sqrt(8*((x+ .1*pi).^2))/5) + 2*pi)]);
% =============================
% Задание 1.6
% =============================
help for;
factoriala(10);
factoriala(18);
factoriala(38);
% =============================
% Задание 1.7
% =============================    
x1 = -6*pi:.01:6*pi;
togetherPlot = plot(x1, (2*sin(-5*x1)), x1, (3*cos(.2*x1)));
% =============================
% Задание 1.8
% =============================
volum = @(r, h) h.*pi*(r.^2); % объем цилиндра
volum(2,3);
areaCyl = @(r, h) 2*pi.*r.*(r + h); % площадь поверхности цилиндра
areaCyl(3,5);
areaTetra = @(a) (a.^2).*sqrt(3); % площадь поверхности правильного тетраэдра
areaTetra(2);
areaGer = @(a, b, c) sqrt(((a+b+c)/2).*(((a+b+c)/2)-a).*(((a+b+c)/2)-b).*...
    (((a+b+c)/2)-c)); % площадь тругольника по формуле Герона
areaGer(1, 2, 3);   
% =============================
% Задание 1.9
% =============================
x3 = -1:.01:1;
T{1} = 1;
T{2} = x3;
figure(3)
colrs = {'r','k','b','m','g', 'y'};
for n = 2:5
    T{n+1} = 2*x3.*T{n}-T{n-1};
    plot(x3,T{1}, colrs{1}, x3, T{2}, colrs{2}, x3, T{n+1}, colrs{n+1}); 
    hold on
end
